Algebra/LinearAlgebraLang/LinearAlgebra.tex
% Created 2024-10-30 Wed 16:39
% Intended LaTeX compiler: xelatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\input{~/Preamble/preamble.tex}
\author{Serge Lang}
\date{\today}
\title{\elzevier Linear Algebra}
\hypersetup{
 pdfauthor={Serge Lang},
 pdftitle={\elzevier Linear Algebra},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Notes taken by Dendy Li}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Vector Spaces}
\label{sec:orgd4bc571}
\begin{definition}[Vector Space]
For field \(K\), \(K\)- vector space \(V\) is a set of objects closed under ``addition'' and ``multiplication'', where these two composition laws are connected by distribution law in the natural sense. Moreover both additive identity and multiplicative identity exist. \(\forall x \in V\), \(x\) has a additive inverse but doesn't have a multiplicative inverse. \(\forall c \in K, x \in V\), composition law between \(c\) and \(x\), is just the scalar product in the natural sense. We call \(V\) the vector space over \(K\).
\end{definition}
\section{Sum, direct sum, product of vector spaces}
\label{sec:orgeac55d5}
\textbf{For convention we denote the vector space in preliminary w.r.t. \(V,W\), the field \(F\).}

\begin{definition}[Sum of vector spaces]
The sum of vector space \(V,W\) is defined as follows:
\[
V + W := \{v + w\vert v\in V, w\in W\}.
\]
\end{definition}

\begin{definition}[Direct Sum of vector spaces]
The direct sum of vector spaces \(V,W\) is defined as follows:
\[
V \oplus W := \{v + w\vert v\in V, w\in W\}.
\]
where \(V \cap W = \emptyset\).
\end{definition}

Unlike the definition of direct sum and sum of vector spaces relies on the operation are the same in the two vector spaces(Namely \(V,W\) are all subspaces in this case). We have a more general convetion of this progcess.

\begin{definition}[Direct Product of vector spaces]
We define the direct product of \(V,W\) as follows:
\[
V \times W := \{(v,w)\vert v\in V, w\in W\}
\]
we don't need \(V,W\) to be the subspaces(Namely has same operation).
\end{definition}
\section{Linear Mappings}
\label{sec:org750899a}
\subsection{Linear Mappings}
\label{sec:org100706a}

\subsection{Kernel and Image}
\label{sec:orgbb763c4}
\section{Bilinear maps and its relation to Matrices}
\label{sec:org2260f16}
\textbf{For convention let \(K\) be field, which can also be seen as one-dimensional vector space over itself. \(U, V, W\) to denote the \(K\)-vector spaces.}


\begin{definition}[Bilinear Map]
Let \(g:U\times V \to W\) be a map. \(g\) is a bilinear map if \(\forall v\in V\), \(g_v:= g(u,v): U\to W\) is a linear map; \(\forall u\in U\), \(g_u:= g(u,v): V\to W\) is a linear map. We say \(g\) is a Bilinear map.
\end{definition}

We have an important theorem to characteristic the relationship between a bilinear map \(g\) and a matrix \(A\).

\begin{theorem}[Corresponding Theorem of bilinear map and matrix]
Given a bilinear map \(g: K^m \times K^n \to K\), then exists a unique \(A\in \mathbb{K}^{m\times n}\), s.t.
\[
g(x,y) = x^T A y, \ \forall x \in K^m, y \in K^n.
\]
\end{theorem}

\begin{proposition}[ ]
Let \(Bli(K^m, K^n):= \{g\vert g:K^m \to K^n, g \ \text{is bilinear}\}\). Then \(Bli(K^m, K^n)\) is a \(K\)-vector space.
\end{proposition}

The next theorem give a correspondence between space of bilinear maps and matrix, which is a baby-case to illustrate the universal property of tensor product.

\begin{theorem}[Isomorphism theorem of Bilinear Maps]
\(Bli(K^m, K^n) \simeq Mat_{m\times n}(K)\).
\end{theorem}

We also have the following commutative diagram:
\begin{center}\begin{tikzcd}
K^m \times K^n \ar[r] \ar[d] & Bli(K^m, K^n) \\
Mat_{m\times n} \ar[ru]
\end{tikzcd}\end{center}
\section{Dual Space and Scalar Product}
\label{sec:org14e2a26}

\begin{definition}[Dual Space]
Let \(V^{\ast}:= \L(V,K)\), we call \(V^{\ast}\) the dual space of \(V\).
\end{definition}

\textbf{Remark: We call the elements in the dual space functionals.}

\begin{proposition}[ ]
Let \(V\) be a \(K\)-vector space of dimension \(n\), then
\[
V \simeq K^n
\]
\end{proposition}

With the above proposition we know that: Once the basis of the vector space \(B_V\) is given, we can associate \(v \in V\) to \(w \in K^n\), by the isomorphism.

\textbf{Motivation: Now we substitute the isomorphism result into the definition of the dual space. Because in this way it is easier to express the morphisms.}

We consider the following commutative diagram:

\begin{center}\begin{tikzcd}
K^n \ar[r, "\text{iso.}"] \ar[dr, dashed, "\varphi"] & V \ar[d] \\
& K
\end{tikzcd}\end{center}

This diagram arise the isomorphism:
\[
K^n \to \L(V,K), \ A \mapsto L_A
\]

Then we have the following result:
\begin{proposition}[ ]
\[
\dim(V) = \dim(V^{\ast})
\]
\end{proposition}
\end{document}
